In [7]:
import pandas as pd
import numpy as np

In [2]:
df = pd.read_csv('../precomputed/ddf--datapoints--income_mountain_numbers--by--country--year--bracket_200.csv')

In [3]:
df.head()

  country  year  bracket  income_mountain
0     afg  1800        0                8
1     afg  1800        1                9
2     afg  1800        2               10
3     afg  1800        3               11
4     afg  1800        4               13

In [4]:
def resample(ser):
    res = pd.Series([x.sum() for x in np.split(ser.values, 50)])
    res.index.name = 'bracket'
    return res

In [8]:
res9 = df.groupby(['country', 'year']).apply(resample)

In [12]:
res = res9.stack().groupby(['country']).max()

In [14]:
res.loc['chn']

226477944

In [15]:
ent = pd.read_csv('../../ddf--entities--geo--country.csv', dtype=str, keep_default_na=False)

In [17]:
ent = ent.set_index('country')

In [44]:
ent['income_mountain_50bracket_max_height_for_log'] = res

In [45]:
ent[pd.isnull(ent.income_mountain_50bracket_max_height_for_log)]

,name,is--country,world_4regions,west_and_rest,on_income_level,wb_income_group,income_mountain_50bracket_max_height_for_log
country,,,,,,,
kos,Kosovo,TRUE,,,,,NaN
xkx,Kosovo,TRUE,,,,,NaN

In [46]:
ent['income_mountain_50bracket_max_height_for_log'] = ent['income_mountain_50bracket_max_height_for_log'].map(
    lambda x: '' if pd.isnull(x) else str(int(x)) 
)

In [47]:
ent

,name,is--country,world_4regions,west_and_rest,on_income_level,wb_income_group,income_mountain_50bracket_max_height_for_log
country,,,,,,,
alb,Albania,TRUE,14,42,24,32,687017
dza,Algeria,TRUE,11,42,23,33,13059714
ago,Angola,TRUE,11,42,23,33,8789395
arg,Argentina,TRUE,12,42,24,32,6989932
arm,Armenia,TRUE,14,42,24,32,674005
...,...,...,...,...,...,...,...
kwt,Kuwait,TRUE,13,42,21,31,953864
bhr,Bahrain,TRUE,13,42,21,31,405828
sau,Saudi Arabia,TRUE,13,42,21,31,7675543
mhl,Marshall Islands,TRUE,13,42,22,32,11430
mco,Monaco,TRUE,14,41,21,31,8028

In [48]:
ent.to_csv('../../ddf--entities--geo--country.csv')

In [28]:
res9.loc[('chn', 1990)]

bracket
0          1739
1          3401
2          5705
3          8996
4         14086
5         21532
6         32851
7         49417
8         76678
9        135657
10       336698
11      1242594
12      4140256
13     11452631
14     26540196
15     55898777
16    105571150
17    168836240
18    226477944
19    209896395
20    155474184
21     99899738
22     55219097
23     28471105
24     13978264
25      6559622
26      3083459
27      1488612
28       797940
29       447944
30       265861
31       162089
32       101608
33        66009
34        43811
35        29838
36        20855
37        14485
38        10257
39         7144
40         4965
41         3469
42         2465
43         1805
44         1385
45         1125
46          969
47          882
48          837
49          819
Name: (chn, 1990), dtype: int64

In [36]:
df = pd.read_csv('../../income_mountain/ddf--datapoints--income_mountain_50bracket_shape_for_log--by--country--year.csv')

In [37]:
df = df.set_index(['country', 'year'])['income_mountain_50bracket_shape_for_log']

In [38]:
df.loc[('chn', 1990)]

'1734, 3379, 5667, 8942, 14016, 21446, 32749, 49298, 76543, 135507, 336533, 1242411, 4140059, 11452417, 26539966, 55898531, 105570887, 168835961, 226477649, 209896085, 155473858, 99899395, 55218738, 28470731, 13977873, 6559215, 3083036, 1488174, 797486, 447474, 265374, 161587, 101089, 65475, 43260, 29272, 20273, 13887, 9643, 6514, 4320, 2807, 1786, 1111, 676, 399, 227, 124, 63, 29'

In [33]:
def findmax(val):
    val_int = map(int, val.split(','))
    return max(val_int)

In [39]:
findmax(df.loc[('chn', 1990)])

226477649

In [40]:
def findmax_in_series(ser):
    return ser.map(findmax).max()

In [41]:
findmax_in_series(df.loc['chn'])

226477649

In [42]:
res = df.groupby('country').apply(findmax_in_series)

In [43]:
res

country
afg    10561865
ago     8789395
alb      687017
and       14850
are     2103785
         ...
wsm       46142
yem     8503151
zaf     7416747
zmb     3747980
zwe     3058283
Name: income_mountain_50bracket_shape_for_log, Length: 195, dtype: int64